Revit 2027 API
BuiltInFailures.SketchFailures.StairRiserDoesntIntersectBoundaryError Property
 The line representing the top of a riser does not intersect one or both of the boundary lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairRiserDoesntIntersectBoundaryError { get; }
Public Shared ReadOnly Property StairRiserDoesntIntersectBoundaryError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairRiserDoesntIntersectBoundaryError {
	FailureDefinitionId^ get ();
}
static member StairRiserDoesntIntersectBoundaryError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace